## [Week 1 Homework official solution](https://www.youtube.com/watch?v=KIh_9tZiroA)

### I am using [SQLFormat](https://sqlformat.org/) for formatting sql queries

## Question 1. Knowing docker tags

### Answer: `--iidfile string`

## Question 2. Understanding docker first run


### Answer: `3`

In [1]:
from sqlalchemy import create_engine
import pandas as pd

engine = create_engine("postgresql://root:root@localhost:5432/ny_taxi")

In [2]:
query = """
SELECT *
FROM green_taxi_trips
LIMIT 5
"""

pd.read_sql(query, con=engine)

,index,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,...,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,0,2,2018-12-21 15:17:29,2018-12-21 15:18:57,N,1,264,264,5,0.00,...,0.5,0.5,0.00,0.0,None,0.3,4.30,2,1,None
1,1,2,2019-01-01 00:10:16,2019-01-01 00:16:32,N,1,97,49,2,0.86,...,0.5,0.5,0.00,0.0,None,0.3,7.30,2,1,None
2,2,2,2019-01-01 00:27:11,2019-01-01 00:31:38,N,1,49,189,2,0.66,...,0.5,0.5,0.00,0.0,None,0.3,5.80,1,1,None
3,3,2,2019-01-01 00:46:20,2019-01-01 01:04:54,N,1,189,17,2,2.68,...,0.5,0.5,2.96,0.0,None,0.3,19.71,1,1,None
4,4,2,2019-01-01 00:19:06,2019-01-01 00:39:43,N,1,82,258,1,4.53,...,0.5,0.5,0.00,0.0,None,0.3,19.30,2,1,None

In [3]:
query = """
SELECT *
FROM zones
LIMIT 5
"""

pd.read_sql(query, con=engine)

   index  LocationID        Borough                     Zone service_zone
0      0           1            EWR           Newark Airport          EWR
1      1           2         Queens              Jamaica Bay    Boro Zone
2      2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3      3           4      Manhattan            Alphabet City  Yellow Zone
4      4           5  Staten Island            Arden Heights    Boro Zone

## Question 3. Count records

In [4]:
# my solution
query = """
SELECT count(*)
FROM green_taxi_trips
WHERE lpep_pickup_datetime :: date = '2019-01-15'
  AND lpep_dropoff_datetime :: date = '2019-01-15'
LIMIT 1
"""

pd.read_sql(query, con=engine)

   count
0  20530

In [5]:
# official solution
query = """
SELECT count(*)
FROM green_taxi_trips
WHERE date(lpep_pickup_datetime) = '2019-01-15'
  AND date(lpep_dropoff_datetime) = '2019-01-15'
LIMIT 1
"""

pd.read_sql(query, con=engine)

   count
0  20530

## thoughts:
- Both solutions are pretty much the same.
- I used ::date, they used date().

## Question 4. Largest trip for each day

In [6]:
# my solution
query = """
SELECT lpep_pickup_datetime :: date
FROM green_taxi_trips
WHERE trip_distance =
    (SELECT max(trip_distance)
     FROM green_taxi_trips)
"""

pd.read_sql(query, con=engine)

  lpep_pickup_datetime
0           2019-01-15

In [7]:
# official solution
query = """
SELECT date(lpep_pickup_datetime),
       max(trip_distance) AS M
FROM green_taxi_trips
GROUP BY date(lpep_pickup_datetime)
ORDER BY M DESC
"""

pd.read_sql(query, con=engine)

          date       m
0   2019-01-15  117.99
1   2019-01-18   80.96
2   2019-01-28   64.27
3   2019-01-10   64.20
4   2019-01-06   60.91
5   2019-01-07   60.08
6   2019-01-01   59.13
7   2019-01-05   51.79
8   2019-01-22   51.36
9   2019-01-24   50.37
10  2019-01-31   50.07
11  2019-01-17   47.48
12  2019-01-26   46.21
13  2019-01-13   44.42
14  2019-01-04   43.84
15  2019-01-03   42.80
16  2019-01-20   42.07
17  2019-01-29   41.37
18  2019-01-12   41.24
19  2019-01-21   41.18
20  2019-01-08   41.01
21  2019-01-27   40.86
22  2019-01-19   40.70
23  2019-01-16   40.19
24  2019-01-09   39.40
25  2019-01-30   38.60
26  2019-01-25   37.41
27  2019-01-23   36.80
28  2019-01-14   36.07
29  2019-01-02   35.57
30  2019-01-11   34.11
31  2009-01-01   11.23
32  2019-02-01    8.84
33  2018-12-31    8.73
34  2010-09-23    6.57
35  2018-12-21    0.00
36  2018-12-05    0.00
37  2018-12-04    0.00
38  2018-12-07    0.00

## thoughts:
- I got the direct date by using a where clause.
- They group by the date and sort by desc, so the date in first row is the required answer.

## Question 5. The number of passengers

In [8]:
# my solution
query = """
SELECT count(*)
FROM green_taxi_trips
WHERE passenger_count = {passenger_count}
  AND lpep_pickup_datetime :: date = '2019-01-01'
"""

for passenger_count in (2, 3):
    number_of_trips = pd.read_sql(
        query.format(passenger_count=passenger_count), con=engine
    ).values[0][0]
    print(f"for {passenger_count=}, {number_of_trips=}")

for passenger_count=2, number_of_trips=1282
for passenger_count=3, number_of_trips=254

In [9]:
# official solution
query = """
SELECT passenger_count,
       count(*)
FROM green_taxi_trips
WHERE date(lpep_pickup_datetime) = '2019-01-01'
GROUP BY passenger_count
"""

pd.read_sql(query, con=engine)

   passenger_count  count
0                0     21
1                1  12415
2                2   1282
3                3    254
4                4    129
5                5    616
6                6    273

## thoughts:
- I used python to pass the passenger_count variable to the query.
- They group by passenger_count to get the answer.

## Question 6. Largest tip

### use "column_name" instead of column_name, due to case insensitivity

[refer this](https://stackoverflow.com/questions/61018823/programmingerror-psycopg2-errors-undefinedcolumn-while-working-with-sqlalche)

In [10]:
# my solution
query = """
SELECT "Zone"
FROM zones
WHERE "LocationID" =
    (SELECT "DOLocationID"
     FROM green_taxi_trips
     WHERE tip_amount=
         (SELECT max(tip_amount)
          FROM green_taxi_trips
          WHERE "PULocationID" =
              (SELECT "LocationID"
               FROM zones
               WHERE "Zone" = 'Astoria' ) ))
"""

pd.read_sql(query, con=engine)

                            Zone
0  Long Island City/Queens Plaza

In [11]:
# official solution
query = """
SELECT z2."Zone",
       max(tip_amount) AS max_tip
FROM green_taxi_trips
INNER JOIN zones z ON green_taxi_trips."PULocationID"=z."LocationID"
INNER JOIN zones z2 ON green_taxi_trips."DOLocationID"=z2."LocationID"
WHERE z."Zone"='Astoria'
GROUP BY z2."Zone"
ORDER BY max_tip DESC
LIMIT 1
"""

pd.read_sql(query, con=engine)

                            Zone  max_tip
0  Long Island City/Queens Plaza     88.0

## thoughts:
- I used subqueries to get the answer and they used joins and group by.
- I prefer their style of the answer as my version has a lot of nesting.
- Should focus more on learning `GROUP BY` and `JOINS` in SQL.